## Final Project Submission

Please fill out:
* Student name: Innocent Mbuvi 
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

# Data-Driven Decision Making: Empowering Microsoft's Movie Studio Venture

# 1. Business Understanding

## Introduction
In a bid to diversify its portfolio and tap into the entertainment industry, Microsoft has embarked on a new venture to create a new movie studio. However, due to the lack of expertise in the realm of film production, Microsoft seeks to leverage data-driven insights from successful films at the box office. As a data analyst, I have been tasked with analyzing the movie industry data to provide actionable insights that will help Microsoft make informed decisions on the types of movies to produce.

## Business Problem
Microsoft sees the potential of the creating original video content and has decided to create a new movie studio. However, they lack the expertise in the film industry and are looking for data-driven insights to help them make informed decisions on the types of movies to produce. The goal of this analysis is to provide actionable insights that will help Microsoft maximize their return on investment and increase their chances of success in the movie industry.

## Objectives
The objectives of this analysis are to:
- Identify the most successful genres at the box office.
- Determine the most successful months for movie releases.
- Identify the most successful directors and actors.
- Identify the most successful production companies.
- Determine the relationship between movie budgets and box office revenue.
- Determine the relationship between production companies and box office revenue.
- Determine the relationship between directors and box office revenue.
- Determine the relationship between actors and box office revenue.
- Determine the relationship between genres and box office revenue.
- Determine the relationship between release months and box office revenue.

## Business Value
The insights from this analysis will help Microsoft make informed decisions on the types of movies to produce, the best time to release movies, the best directors and actors to work with, and the best production companies to partner with. This will help Microsoft maximize their return on investment and increase their chances of success in the movie industry.

## Source of Data
1. https://www.boxofficemojo.com/
2. https://www.imdb.com/
3. https://www.rottentomatoes.com/
4. https://www.themoviedb.org/
5. https://www.the-numbers.com/

# 2. Data Understanding
In this section, the following will be carried out:
- Load the data and explore it to understand its structure and contents.
- Check for missing values and duplicates.
- Identify the relevant data for our analysis.

### Importing the necesary libraries and loading the data

In [1]:
#Importing necessary libraries
import csv
import pandas as pd
import _sqlite3

In [2]:
#LOADING THE DATA

#Loading the data from the csv file
box_office = pd.read_csv('data/bom.movie_gross.csv')
the_movie = pd.read_csv('data/tmdb.movies.csv')
the_number = pd.read_csv('data/tn.movie_budgets.csv')

#Loading the data from the tsv file
rotten_tomatoes_movie = pd.read_csv('data/rt.movie_info.tsv', delimiter='\t')
rotten_tomatoes_review = pd.read_csv('data/rt.reviews.tsv', delimiter='\t', encoding='latin1')

#Loading data from a database
#Connecting to the database
conn = _sqlite3.connect('data/im.db')

## Explore Data Characteristics

## a. Box Office Mojo

In [3]:
# columns in the data
box_office.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [4]:
''''
The data contains 5 columns. The columns are:
- title
- studio
- domestic_gross
- foreign_gross
- year
'''

"'\nThe data contains 5 columns. The columns are:\n- title\n- studio\n- domestic_gross\n- foreign_gross\n- year\n"

In [5]:
# Data types of the columns and total number of entries
box_office.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [6]:
'''
The various data types are: 
- object - title, studio, foreign_gross
- int64 - year
- float64 - domestic_gross

The total number of entries is 3387
'''

'\nThe various data types are: \n- object - title, studio, foreign_gross\n- int64 - year\n- float64 - domestic_gross\n\nThe total number of entries is 3387\n'

In [7]:
# Checking for missing values
null_values = box_office.isnull()
print(null_values.sum())

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [8]:
'''
There are a total of 1383 missing values.
studio has 5 missing values
foreign_gross has 1350 missing values
domestic_gross has 28 missing values

'''

'\nThere are a total of 1383 missing values.\nstudio has 5 missing values\nforeign_gross has 1350 missing values\ndomestic_gross has 28 missing values\n\n'

In [9]:
#Checking for duplicates
duplicates = box_office.duplicated()
print(duplicates.sum())

0

In [10]:
'''
There are no duplicates in the data.
'''

'\nThere are no duplicates in the data.\n'

## b. IMDB

In [11]:
# Fetch table names from the database
table_names = pd.read_sql('SELECT name FROM sqlite_master WHERE type="table";', conn)
table_names

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [12]:
''' 
The database contains the following tables which are:
- movie_basics
- directors
- known_for
- movie_akas
- movie_ratings
- persons
- principals
- writers
'''

' \nThe database contains the following tables which are:\n- movie_basics\n- directors\n- known_for\n- movie_akas\n- movie_ratings\n- persons\n- principals\n- writers\n'

In [13]:
#Store data in the database into a dataframe for easy identification of null values
query_movie_basics = '''
SELECT * FROM movie_basics
'''
movie_basics = pd.read_sql(query_movie_basics, conn)
movie_basics

query_directors = '''
SELECT * FROM directors
'''
directors = pd.read_sql(query_directors, conn)

query_known_for = '''
SELECT * FROM known_for
'''
known_for = pd.read_sql(query_known_for, conn)

query_movie_akas = '''
SELECT * FROM movie_akas
'''
movie_akas = pd.read_sql(query_movie_akas, conn)

query_movie_ratings = '''
SELECT * FROM movie_ratings
'''
movie_ratings = pd.read_sql(query_movie_ratings, conn)

query_persons = '''
SELECT * FROM persons
'''
persons = pd.read_sql(query_persons, conn)

query_principals = '''
SELECT * FROM principals
'''
principals = pd.read_sql(query_principals, conn)

query_writers = '''
SELECT * FROM writers
'''
writers = pd.read_sql(query_writers, conn)

In [14]:
#Check for missing values in movie_basics table
null_values_movie_basics = movie_basics.isnull()
print(null_values_movie_basics.sum())
- movie_basics - 146144

movie_id               0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

TypeError: bad operand type for unary -: 'str'

In [ ]:
#Check for missing values in directors table
null_values_directors = directors.isnull()
print(null_values_directors.sum())

movie_id     0
person_id    0
dtype: int64

In [ ]:
'There are no missing values in the directors table'

In [ ]:
#Check for missing values in known_for table
null_values_known_for = known_for.isnull()
print(null_values_known_for.sum())

person_id    0
movie_id     0
dtype: int64

In [ ]:
'There are no missing values in the known_for table'

,movie_title_id,missing_ordering,missing_title,missing_region,missing_language,missing_types,missing_attributes,missing_is_original_title
0,0,0,0,53293,289988,163256,316778,25

In [ ]:
#Check for missing values in movie_akas table
null_values_movie_akas = movie_akas.isnull()
print(null_values_movie_akas.sum())

movie_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
attributes           316778
is_original_title        25
dtype: int64

In [ ]:
'''
The movie_akas table has the following missing values:
- region - 53293
- language - 289988
- types - 163256
- attributes - 316778
- is_original_title - 25
'''

In [ ]:
#Check for missing values in movie_ratings table
null_values_movie_ratings = movie_ratings.isnull()
print(null_values_movie_ratings.sum())

movie_id         0
averagerating    0
numvotes         0
dtype: int64

In [ ]:
'There are no missing values in the movie_ratings table'

In [ ]:
#Check for missing values in persons table
null_values_persons = persons.isnull()
print(null_values_persons.sum())

person_id                  0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
dtype: int64

In [ ]:
'''
The persons table has the following missing values:
- birth_year - 523912
- death_year - 599865
- primary_profession - 51340
'''

In [ ]:
#Check for missing values in principals table
null_values_principals = principals.isnull()
print(null_values_principals.sum())

movie_id           0
ordering           0
person_id          0
category           0
job           850502
characters    634826
dtype: int64

In [ ]:
'''
The principals table has the following missing values:
- job - 850502
- characters - 634826
'''

In [ ]:
#Check for missing values in writers table
null_values_writers = writers.isnull()
print(null_values_writers.sum())

movie_id     0
person_id    0
dtype: int64

In [ ]:
'''
The writers table has no missing values:

'''

## c. Rotten Tomatoes

In [ ]:
# Columns in the dataset
rotten_tomatoes_movie.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [ ]:
'''
Columns in the rotten_tomatoes_movie dataset are:
- id
- synopsis
- rating
- genre
- director
- writer
- theater_date
- dvd_date
- currency
- box_office
- runtime

'''

'\nColumns in the rotten_tomatoes_movie dataset are:\n- id\n- synopsis\n- rating\n- genre\n- director\n- writer\n- theater_date\n- dvd_date\n- currency\n- box_office\n- runtime\n\n'

In [ ]:
# Data types of the columns and total number of entries
rotten_tomatoes_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [ ]:
'''
This dataset has the following data types:
- int64 - id
- object - synopsis, rating, genre, director, writer, theater_date, dvd_date, currency, box_office

The total number of entries is 1560
'''

'\nThis dataset has the following data types:\n- int64 - id\n- object - synopsis, rating, genre, director, writer, theater_date, dvd_date, currency, box_office\n\nThe total number of entries is 1560\n'

In [ ]:
# Checking for missing values
null_values = rotten_tomatoes_movie.isnull()
print(null_values.sum())

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [ ]:
'''
synopsis has 62 missing values
rating has 3 missing values
genre has 8 missing values
director has 199 missing values
writer has 449 missing values
theater_date has 359 missing values
dvd_data has 359 missing values
currency has 1220 missing values
box_office has 1220 missing values
runtime has 30 missing values
studio has 1066 missing values

There are total of 4975 missing values in the dataset.
'''

'\nsynopsis has 62 missing values\nrating has 3 missing values\ngenre has 8 missing values\ndirector has 199 missing values\nwriter has 449 missing values\ntheater_date has 359 missing values\ndvd_data has 359 missing values\ncurrency has 1220 missing values\nbox_office has 1220 missing values\nruntime has 30 missing values\nstudio has 1066 missing values\n\nThere are total of 4975 missing values in the dataset.\n'

In [ ]:
#Checking for duplicates
duplicates = rotten_tomatoes_movie.duplicated()
print(duplicates.sum())

0

In [ ]:
'There are no duplicates in the dataset'

'There are no duplicates in the dataset'

c.(i) Rotten Tomatoes Reviews

In [ ]:
# Columns in the dataset
rotten_tomatoes_review.columns

Index(['id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher',
       'date'],
      dtype='object')

In [ ]:
'''
This dataset has the following columns:
- id
- review
- rating
- fresh
- critic
- top_critic
- publisher
- date
'''

'\nThis dataset has the following columns:\n- id\n- review\n- rating\n- fresh\n- critic\n- top_critic\n- publisher\n- date\n'

In [ ]:
# Data types of the columns and total number of entries
rotten_tomatoes_review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [ ]:
'''
The dataset has the following datatypes:
- int64 - id, top_critic
- object - review, rating, fresh, critic, publisher, date

The total number of entries is 54432
'''

'\nThe dataset has the following datatypes:\n- int64 - id, top_critic\n- object - review, rating, fresh, critic, publisher, date\n\nThe total number of entries is 54432\n'

In [ ]:
#Checking for missing values
null_values = rotten_tomatoes_review.isnull()
print(null_values.sum())

id                0
review         5563
rating        13517
fresh             0
critic         2722
top_critic        0
publisher       309
date              0
dtype: int64

In [ ]:
'''
review has 5563 missing values
rating has 13517 missing values
critic has 2722 missing values
publisher has 309 missing values

There are total of 22111 missing values in the dataset
'''

'\nreview has 5563 missing values\nrating has 13517 missing values\ncritic has 2722 missing values\npublisher has 309 missing values\n\nThere are total of 22111 missing values in the dataset\n'

In [ ]:
#Check for duplicates
duplicates = rotten_tomatoes_review.duplicated()
print(duplicates.sum())

9

In [ ]:
'There are 9 duplicates in the dataset'

'There are 9 duplicates in the dataset'

## d. The Movie Database (TMDb)

In [ ]:
# Columns in the dataset
the_movie.columns

Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [ ]:
'''
The columns in the dataset are:
- genre_ids
- id
- original_language
- original_title
- popularity
- release_date
- title
- vote_average
- vote_count

There is one unnamed column in the dataset
'''

'\nThe columns in the dataset are:\n- genre_ids\n- id\n- original_language\n- original_title\n- popularity\n- release_date\n- title\n- vote_average\n- vote_count\n\nThere is one unnamed column in the dataset\n'

In [ ]:
# Data types of the columns and total number of entries
the_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [ ]:
'''
The dataset has the following data types:
- int64 - id, vote_count, unnamed: 0
- object - genre_ids, original_language, original_title, release_date, title
- float64 - popularity, vote_average

'''

'\nThe dataset has the following data types:\n- int64 - id, vote_count, unnamed: 0\n- object - genre_ids, original_language, original_title, release_date, title\n- float64 - popularity, vote_average\n\n'

In [ ]:
# Checking for missing values
null_values = the_movie.isnull()
print(null_values.sum())

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [ ]:
'There are no null values in the dataset'

'There are no null values in the dataset'

In [ ]:
#Checking for duplicates
duplicates = the_movie.duplicated()
print(duplicates.sum())

0

In [ ]:
'There are no duplicates in the dataset'

'There are no duplicates in the dataset'

## e. The Numbers

In [ ]:
# Columns in the dataset
the_number.columns

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [ ]:
'''
The columns in this dataset are:
- id
- release_date
- movie
- production_budget
- domestic_gross
- worldwide_gross
'''

'\nThe columns in this dataset are:\n- id\n- release_date\n- movie\n- production_budget\n- domestic_gross\n- worldwide_gross\n'

In [ ]:
# Data Types and total number of entries
the_number.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [ ]:
'''
The dataset has the following data types:
- int64 - id
- object - release_date, movie, production_budget, domestic_gross, worldwide_gross

There are a total of 5782 entries in the dataset
'''

'\nThe dataset has the following data types:\n- int64 - id\n- object - release_date, movie, production_budget, domestic_gross, worldwide_gross\n\nThere are a total of 5782 entries in the dataset\n'

In [ ]:
# Checking missing values
null_values = the_number.isnull()
print(null_values.sum())

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [ ]:
'There are no missing values in the dataset'

'There are no missing values in the dataset'

In [ ]:
#Checking for duplicates
duplicates = the_number.duplicated()
print(duplicates.sum())

0

In [ ]:
'There are no duplicates in the dataset'

'There are no duplicates in the dataset'

## Conclusion
Based on the data understanding and data quality checks done for the various datasets provided, the following datasets are suitable for carrying out analysis:
- Box Office Mojo (bom.movie_gross.csv)
- The Numbers (tn.movie_budgets.csv)
- IMDB (im.db)

- The above datasets are suitable for analysis because the data answers the questions that we are trying to answer.
- The datasets have minimal missing values and no duplicates which is suitable for analysis.

# 3. Data Preparation
In this section the following will be carried out:
- Clean the data by addressing missing values, correcting errors, and removing duplicates.
- Standardize data formats and units to facilitate uniform analysis.
- Perform feature engineering to create new variables or derive additional insights from existing data attributes.
- Transform categorical variables into numerical representations.

## a. Box Office Mojo

In [ ]:
#Addressing missing values in the box_office dataset
#Drop missing values in the studio column
box_office.dropna(subset=['studio'], inplace=True)

#Drop missing values in the domestic_gross column
box_office.dropna(subset = ['domestic_gross'], inplace=True)

#Drop missing values in the foreign_gross column
box_office.dropna(subset = ['foreign_gross'], inplace=True)

In [ ]:
#Check if there are any missing values remaining
null_values = box_office.isnull()
print(null_values.sum())

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [ ]:
box_office.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   object
 4   year            2007 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 94.1+ KB

In [ ]:
'''
The strategy used to handle missing values in the box_office dataset 
was to drop the missing values in the studio, domestic_gross and foreign_gross columns.
This is because the missing values in these columns are not too many and dropping them will not affect the dataset since the
dataset has a total of 3387 entries.
'''

In [ ]:
#Change the data type of the foreign_gross column to float
box_office['foreign_gross'] = box_office['foreign_gross'].str.replace(',', '').astype(float)

In [ ]:
box_office.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   float64
 4   year            2007 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 94.1+ KB

In [ ]:
'''
Change the data type of foreign gross to float since it contains numerical values. 
'''

In [ ]:
# Perform feature engineering to create a new column called total_gross
# This column will contain the sum of the domestic_gross and foreign_gross columns
# representing the total gross of the movie
box_office['total_gross'] = box_office['domestic_gross'] + box_office['foreign_gross']
box_office.head()

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08

In [ ]:
#Perform feature engineering to create a new column called age of movie
#This column will contain the difference between the current year and the year the movie was released
# representing the age of the movie

#Import the datetime library
import datetime
current_year = datetime.datetime.now().year
box_office['age_of_movie'] = current_year - box_office['year']
box_office.tail(10)

,title,studio,domestic_gross,foreign_gross,year,total_gross,age_of_movie
3261,Gauguin: Voyage to Tahiti,Cohen,200000.0,3100000.0,2018,3300000.0,6
3263,The Front Runner,Sony,2000000.0,1200000.0,2018,3200000.0,6
3265,Wildlife,IFC,1100000.0,2000000.0,2018,3100000.0,6
3268,Billionaire Boy's Club,VE,1300.0,2500000.0,2018,2501300.0,6
3271,Bilal: A New Breed of Hero,VE,491000.0,1700000.0,2018,2191000.0,6
3275,I Still See You,LGF,1400.0,1500000.0,2018,1501400.0,6
3286,The Catcher Was a Spy,IFC,725000.0,229000.0,2018,954000.0,6
3309,Time Freak,Grindstone,10000.0,256000.0,2018,266000.0,6
3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200.0,2018,98400.0,6
3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000.0,2018,73200.0,6

## b. IMDB

### Addressing Missing Values

a. movie_basics table

In [ ]:
# Addressing missing values from movie_basics table
#Replace the null values in the original_title column with 'Unknown' since the column contains categorical values
movie_basics['original_title'] = movie_basics['original_title'].fillna('Unknown')

#Replace the null values in the runtime_minutes column with the median value since the column contains numerical values
#and the median is not affected by outliers
movie_basics['runtime_minutes'] = movie_basics['runtime_minutes'].fillna(movie_basics['runtime_minutes'].median())

#Replace the null values in the genres column with 'Unknown' since the column contains categorical values
movie_basics['genres'] = movie_basics['genres'].fillna('Unknown')

In [ ]:
movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146144 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  146144 non-null  float64
 5   genres           146144 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

b. movie_akas table

In [ ]:
#Addressing missing values from the movie_akas table
#Replace the null values in the region column with 'Unknown' since the column contains categorical values
movie_akas['region'] = movie_akas['region'].fillna('Unknown')

#Replace the null values in the language column with 'Unknown' since the column contains categorical values
movie_akas['language'] = movie_akas['language'].fillna('Unknown')

#Replace the null values in the types column with 'Unknown' since the column contains categorical values
movie_akas['types'] = movie_akas['types'].fillna('Unknown')

#Replace the null values in the attributes column with 'Unknown' since the column contains categorical values
movie_akas['attributes'] = movie_akas['attributes'].fillna('Unknown')

#drop the null values in the is_original_title column since the number of missing values is not too many
movie_akas.dropna(subset=['is_original_title'], inplace=True)

In [ ]:
movie_akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 331678 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331678 non-null  object
 1   ordering           331678 non-null  int64
 2   title              331678 non-null  object
 3   region             331678 non-null  object
 4   language           331678 non-null  object
 5   types              331678 non-null  object
 6   attributes         331678 non-null  object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 22.8+ MB

c. persons table

In [ ]:
# Addressing missing values from the persons table
#drop the columns since the data of the columns are not relevant to the analysis
persons.drop(['birth_year'], axis=1, inplace=True)

#drop the columns since the data of the columns are not relevant to the analysis
persons.drop(['death_year'], axis=1, inplace=True)

#Replace the null values in the primary_profession column with 'Unknown' since the column contains categorical values
persons['primary_profession'] = persons['primary_profession'].fillna('Unknown')

In [ ]:
persons.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 3 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   primary_profession  606648 non-null  object
dtypes: object(3)
memory usage: 13.9+ MB

d. principals table

In [ ]:
#Addressing missing values from the principals table
#Replace the null values in the job column with 'Unknown' since the column contains categorical values
principals['job'] = principals['job'].fillna('Unknown')

#Replace the null values in the characters column with 'Unknown' since the column contains categorical values
principals['characters'] = principals['characters'].fillna('Unknown')

In [ ]:
principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         1028186 non-null  object
 5   characters  1028186 non-null  object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

### Joining Tables

In [ ]:
# Join movie_basics table and movie_ratings table on the movie_id column
# This is to analyze movie ratings and other attributes of the movies
movie_basics_ratings = movie_basics.merge(movie_ratings, how='left', on='movie_id')
movie_basics_ratings.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,87.0,"Comedy,Drama",6.1,13.0
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

In [ ]:
# Join movies_basics_ratings table and principals table on the movie_id column
# To analyze involvement of persons in the movies
movie_basics_principals = movie_basics.merge(principals, how='left', on='movie_id')
movie_basics_principals.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,ordering,person_id,category,job,characters
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",10.0,nm0006210,composer,Unknown,Unknown
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",1.0,nm0474801,actor,Unknown,"[""Kundan S. Prasad"",""Bajrangi""]"
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",2.0,nm0904537,actress,Unknown,"[""Munni"",""Laila-E-Aasmaan""]"
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",3.0,nm0756379,actor,Unknown,"[""Ganeshi N. Prasad""]"
4,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",4.0,nm0474876,actor,Unknown,"[""Dwarka N. Prasad""]"

In [ ]:
# Join movie_basics table and directors table on the movie_id column
# To identify movies directed by specific dirctors
movie_basics_directors = movie_basics.merge(directors, how='left', on='movie_id')
movie_basics_directors.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,person_id
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0712540
4,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",nm0002411

In [ ]:
#Join movie_basics table and writers table on the movie_id column
#To identify movies written by specific writers
movie_basics_writers = movie_basics.merge(writers, how='left', on='movie_id')
movie_basics_writers.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,person_id
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0023551
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm1194313
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm0347899
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",nm1391276
4,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",NaN

In [ ]:
#Join persons table and known_for table on the person_id column
#to associate individuals with their known movies, providing insights into their contributions and successes.
persons_known_for = persons.merge(known_for, how='left', on='person_id')
persons_known_for.head()

,person_id,primary_name,primary_profession,movie_id
0,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer",tt0837562
1,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer",tt2398241
2,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer",tt0844471
3,nm0061671,Mary Ellen Bauder,"miscellaneous,production_manager,producer",tt0118553
4,nm0061865,Joseph Bauer,"composer,music_department,sound_department",tt0896534

## c. The Numbers

In [15]:
# Turn the production_budget, domestic_gross and worldwide_gross columns to float
# This is because the columns contain numerical values
# Remove the commas and dollar signs from the columns
the_number['production_budget'] = the_number['production_budget'].str.replace(',', '').str.replace('$', '').astype(float)
the_number['domestic_gross'] = the_number['domestic_gross'].str.replace(',', '').str.replace('$', '').astype(float)
the_number['worldwide_gross'] = the_number['worldwide_gross'].str.replace(',', '').str.replace('$', '').astype(float)

In [16]:
# Turn the release_date column to datetime
the_number['release_date'] = pd.to_datetime(the_number['release_date'])

In [17]:
the_number.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 271.2+ KB

In [18]:
# Feature engineering to create a new column called total_gross
# This column will contain the sum of the domestic_gross and worldwide_gross columns
# representing the total gross of the movie
the_number['total_gross'] = the_number['domestic_gross'] + the_number['worldwide_gross']
the_number.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_gross
0,1,2009-12-18,Avatar,425000000.0,760507625.0,2.776345e+09,3.536853e+09
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09,1.286728e+09
2,3,2019-06-07,Dark Phoenix,350000000.0,42762350.0,1.497624e+08,1.925247e+08
3,4,2015-05-01,Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09,1.862020e+09
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09,1.936903e+09

In [20]:
#Feature engineering to create a new column called profit
#This column will contain the difference between the total_gross and the production_budget columns
#representing the profit made from the movie
the_number['profit'] = the_number['total_gross'] - the_number['production_budget']
the_number.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_gross,profit
5777,78,2018-12-31,Red 11,7000.0,0.0,0.0,0.0,-7000.0
5778,79,1999-04-02,Following,6000.0,48482.0,240495.0,288977.0,282977.0
5779,80,2005-07-13,Return to the Land of Wonders,5000.0,1338.0,1338.0,2676.0,-2324.0
5780,81,2015-09-29,A Plague So Pleasant,1400.0,0.0,0.0,0.0,-1400.0
5781,82,2005-08-05,My Date With Drew,1100.0,181041.0,181041.0,362082.0,360982.0